; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 142075 2 1 2 4 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	spectrograph1 - mode
	thermograph0 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Star4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
)
(:goal (and
	(pointing satellite0 Phenomenon6)
	(pointing satellite1 Planet5)
	(have_image Star4 spectrograph1)
	(have_image Planet5 thermograph0)
	(have_image Phenomenon6 thermograph0)
	(have_image Star7 thermograph0)
	(have_image Star8 spectrograph1)
	(have_image Planet9 spectrograph1)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 8
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
3. (calibrate satellite1 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 0 of 8
4. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 8
5. (turn_to satellite1 star7 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 star7)
   goals met: 0 of 8
6. (turn_to satellite0 star8 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star8)
   goals met: 0 of 8
7. (take_image satellite1 star7 instrument1 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 1 of 8
8. (take_image satellite0 star8 instrument0 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 2 of 8
9. (turn_to satellite0 star4 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star4)
   goals met: 2 of 8
10. (turn_to satellite1 planet5 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet5)
   goals met: 3 of 8
11. (take_image satellite1 planet5 instrument1 thermograph0)
   added: (have_image planet5 thermograph0)
   goals met: 4 of 8
12. (take_image satellite0 star4 instrument0 spectrograph1)
   added: (have_image star4 spectrograph1)
   goals met: 5 of 8
13. (turn_to satellite0 planet9 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet9)
   goals met: 5 of 8
14. (turn_to satellite1 phenomenon6 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 phenomenon6)
   goals met: 4 of 8
15. (take_image satellite0 planet9 instrument0 spectrograph1)
   added: (have_image planet9 spectrograph1)
   goals met: 5 of 8
16. (take_image satellite1 phenomenon6 instrument1 thermograph0)
   added: (have_image phenomenon6 thermograph0)
   goals met: 6 of 8
17. (turn_to satellite0 phenomenon6 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon6)
   goals met: 7 of 8
18. (turn_to satellite1 planet5 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 planet5)
   goals met: 8 of 8
